ArtShareAPI/app/controllers/ArtworksController.rb

SELECT "artworks".* FROM "artworks"
---
    def index
        @artworks = Artwork.all

INSERT INTO "artworks" ("image_url", "artist_id", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image_url", "milktea.com"], ["artist_id", 2], ["created_at", "2023-04-13 20:47:45.259490"], ["updated_at", "2023-04-13 20:47:45.259490"], ["title", "boba"]]
---
    def create
        artwork = Artwork.new(artwork_params)

        if artwork.save!

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @artwork = Artwork.find(params[:id])

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 3]]
---
    def destroy
        @artwork = Artwork.find(params[:id])
        @artwork.destroy