ArtShareAPI/app/controllers/UsersController.rb

SELECT "users".* FROM "users"
---
    def index
      @users = User.all

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "jeremy"], ["created_at", "2023-04-13 20:40:45.905709"], ["updated_at", "2023-04-13 20:40:45.905709"]]
---
    def create
      user = User.new(user_params)
      # replace the `user_attributes_here` with the actual attribute keys
      if user.save!

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
      @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "jerome"], ["updated_at", "2023-04-13 20:42:05.037219"], ["id", 2]]
---
    def update
      @user = User.find(params[:id])
      if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
    def destroy
      @user = User.find(params[:id])
      @user.destroy